; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_1 ?v1 - type_1 ?v8 - type_2)
 	      (pred_4 ?v4 - object ?v8 - type_2)
	      (pred_3 ?v1 - type_1 ?v6 - type_3)
	      (pred_2 ?v1 - type_1 ?v4 - object ?v6 - type_3))

   (:action op_2
       :parameters  (?v1 - type_1 ?v3 ?v2 - type_2)
       :precondition (and  (pred_1 ?v1 ?v3))
       :effect (and  (pred_1 ?v1 ?v2)
		     (not (pred_1 ?v1 ?v3))))

   (:action op_3
       :parameters (?v1 - type_1 ?v5 - object ?v7 - type_2 ?v6 - type_3)
       :precondition  (and  (pred_4 ?v5 ?v7) (pred_1 ?v1 ?v7) (pred_3 ?v1 ?v6))
       :effect (and (pred_2 ?v1 ?v5 ?v6)
		    (not (pred_4 ?v5 ?v7)) 
		    (not (pred_3 ?v1 ?v6))))

   (:action op_1
       :parameters (?v1 - type_1 ?v5 - object ?v7 - type_2 ?v6 - type_3)
       :precondition  (and  (pred_2 ?v1 ?v5 ?v6) (pred_1 ?v1 ?v7))
       :effect (and (pred_4 ?v5 ?v7)
		    (pred_3 ?v1 ?v6)
		    (not (pred_2 ?v1 ?v5 ?v6)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_04 obj_14 - type_1
obj_11 obj_12 obj_10 obj_05 - type_3
obj_02 obj_03 obj_08 obj_01 - type_2
obj_09 obj_06 obj_07 obj_13 - object)
(:init
(pred_1 obj_04 obj_01)
(pred_3 obj_04 obj_11)
(pred_3 obj_04 obj_12)
(pred_1 obj_14 obj_01)
(pred_3 obj_14 obj_10)
(pred_3 obj_14 obj_05)
(pred_4 obj_09 obj_01)
(pred_4 obj_06 obj_03)
(pred_4 obj_07 obj_01)
(pred_4 obj_13 obj_02)
)
(:goal
(and
(pred_4 obj_09 obj_03)
(pred_4 obj_06 obj_08)
(pred_4 obj_07 obj_08)
(pred_4 obj_13 obj_03)
)
)

(:constraints
  (always (not (pred_1 obj_04 obj_08)))
)
)

; plan
1. (op_3 obj_04 obj_09 obj_01 obj_11)
   deleted: (pred_4 obj_09 obj_01) (pred_3 obj_04 obj_11)
   added: (pred_2 obj_04 obj_09 obj_11)
   goals met: 0 of 4
2. (op_3 obj_14 obj_07 obj_01 obj_05)
   deleted: (pred_4 obj_07 obj_01) (pred_3 obj_14 obj_05)
   added: (pred_2 obj_14 obj_07 obj_05)
   goals met: 0 of 4
3. (op_2 obj_04 obj_01 obj_03)
   deleted: (pred_1 obj_04 obj_01)
   added: (pred_1 obj_04 obj_03)
   goals met: 0 of 4
4. (op_2 obj_14 obj_01 obj_08)
   deleted: (pred_1 obj_14 obj_01)
   added: (pred_1 obj_14 obj_08)
   goals met: 0 of 4
5. (op_1 obj_14 obj_07 obj_08 obj_05)
   deleted: (pred_2 obj_14 obj_07 obj_05)
   added: (pred_4 obj_07 obj_08) (pred_3 obj_14 obj_05)
   goals met: 1 of 4
6. (op_1 obj_04 obj_09 obj_03 obj_11)
   deleted: (pred_2 obj_04 obj_09 obj_11)
   added: (pred_4 obj_09 obj_03) (pred_3 obj_04 obj_11)
   goals met: 2 of 4
7. (op_3 obj_04 obj_06 obj_03 obj_12)
   deleted: (pred_4 obj_06 obj_03) (pred_3 obj_04 obj_12)
   added: (pred_2 obj_04 obj_06 obj_12)
   goals met: 2 of 4
8. (op_2 obj_14 obj_08 obj_02)
   deleted: (pred_1 obj_14 obj_08)
   added: (pred_1 obj_14 obj_02)
   goals met: 2 of 4
9. (op_1 obj_04 obj_06 obj_03 obj_12)
   deleted: (pred_2 obj_04 obj_06 obj_12)
   added: (pred_4 obj_06 obj_03) (pred_3 obj_04 obj_12)
   goals met: 2 of 4
10. (op_3 obj_14 obj_13 obj_02 obj_05)
   deleted: (pred_4 obj_13 obj_02) (pred_3 obj_14 obj_05)
   added: (pred_2 obj_14 obj_13 obj_05)
   goals met: 2 of 4
11. (op_2 obj_14 obj_02 obj_03)
   deleted: (pred_1 obj_14 obj_02)
   added: (pred_1 obj_14 obj_03)
   goals met: 2 of 4
12. (op_1 obj_14 obj_13 obj_03 obj_05)
   deleted: (pred_2 obj_14 obj_13 obj_05)
   added: (pred_4 obj_13 obj_03) (pred_3 obj_14 obj_05)
   goals met: 3 of 4
13. (op_3 obj_14 obj_06 obj_03 obj_05)
   deleted: (pred_4 obj_06 obj_03) (pred_3 obj_14 obj_05)
   added: (pred_2 obj_14 obj_06 obj_05)
   goals met: 3 of 4
14. (op_2 obj_14 obj_03 obj_08)
   deleted: (pred_1 obj_14 obj_03)
   added: (pred_1 obj_14 obj_08)
   goals met: 3 of 4
15. (op_1 obj_14 obj_06 obj_08 obj_05)
   deleted: (pred_2 obj_14 obj_06 obj_05)
   added: (pred_4 obj_06 obj_08) (pred_3 obj_14 obj_05)
   goals met: 4 of 4
